# -*- mode: org -*-
# -*- coding: utf-8 -*-
# -*- org-src-preserve-indentation: t; org-edit-src-content: 0; -*-

# ==============================================================================
# author          :Ghislain Vieilledent
# email           :ghislain.vieilledent@cirad.fr, ghislainv@gmail.com
# web             :https://ecology.ghislainv.fr
# license         :GPLv3
# ==============================================================================

#+title: Aravo
#+author: Ghislain Vieilledent
#+email: ghislain.vieilledent@cirad.fr

#+LANGUAGE: en
#+TAGS: Blog(B) noexport(n) Stats(S)
#+TAGS: Ecology(E) R(R) OrgMode(O) Python(P)
#+EXPORT_SELECT_TAGS: Blog
#+OPTIONS: H:3 num:t toc:nil \n:nil @:t ::t |:t ^:{} -:t f:t *:t <:t
#+OPTIONS: html-postamble:nil
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+HTML_DOCTYPE: html5
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css"/>

# For math display
#+LATEX_HEADER: \usepackage{amsfonts}
#+LATEX_HEADER: \usepackage{unicode-math}

#+PROPERTY: header-args :eval never-export

* Libraries

#+begin_src python :results output :session :exports both
import arviz as az
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import pickle
import pymc3 as pm
import theano

print(f"Running on PyMC3 v{pm.__version__}")
#+end_src

#+RESULTS:
: Running on PyMC3 v3.11.2

** Importing data

Data include abundances of 82 species in 75 sites. Species are
discribed by 8 functional traits and envronment on each site is
discribed by 6 variables.

#+begin_src python :results output :session :exports both
aravo_spe = pd.read_csv("data/aravo/aravo_spe.csv")
aravo_env = pd.read_csv("data/aravo/aravo_env.csv")
aravo_traits = pd.read_csv("data/aravo/aravo_traits.csv")
n_sites = aravo_spe.shape[0]
n_species = aravo_spe.shape[1]
print(aravo_spe.shape)
print(aravo_env.shape)
print(aravo_traits.shape)
#+end_src

#+RESULTS:
: (75, 82)
: (75, 6)
: (82, 8)

#+begin_src python :results output :session :exports both
print(aravo_env.head())
print()
print(aravo_traits.head())
#+end_src

#+RESULTS:
#+begin_example
Aspect  Slope  Form  PhysD ZoogD  Snow
0       7      2     1     50    no   140
1       1     35     3     40    no   140
2       5      0     3     20    no   140
3       9     30     3     80    no   140
4       9      5     1     80    no   140

   Height  Spread  Angle   Area  Thick   SLA  N_mass  Seed
0     6.0      10     80   60.0   0.12   8.1  218.70  0.08
1     5.0      20     20  190.9   0.20  15.1  203.85  0.21
2    15.0       5     50  280.0   0.08  18.0  219.60  0.54
3     0.0      30     80  600.0   0.20  10.6  233.20  1.72
4    12.0      30     60  420.0   0.14  12.5  156.25  1.17
#+end_example

** Preparing data

Transform abundances into presences-absences.

#+begin_src python :results output :session :exports both
aravo_spe_occ = aravo_spe.mask(aravo_spe > 0, 1)
#+end_src

#+RESULTS:

Select only species present on more than 5 sites.

#+begin_src python :results output :session :exports both
nocc_per_species = aravo_spe_occ.sum(0)
Y = aravo_spe_occ.iloc[:, (nocc_per_species >= 5).values]
n_species = Y.shape[1]
print(Y.shape)
print(n_species)
#+end_src

#+RESULTS:
: (75, 65)
: 65

Use a degree 2 polynom for snow.

#+begin_src python :results output :session :exports both
Z = ortho_poly_fit(aravo_env["Snow"], 2)
X = Z[0][:, (1, 2)]
print(X[:5,])
#+end_src

#+RESULTS:
: [[-0.15715774  0.15876418]
:  [-0.15715774  0.15876418]
:  [-0.15715774  0.15876418]
:  [-0.15715774  0.15876418]
:  [-0.15715774  0.15876418]]

Number of fixed parameters and latent variables.

#+begin_src python :results output :session :exports both
n_p = X.shape[1]
n_q = 2
print(X.shape)
print((n_p, n_q))
#+end_src

#+RESULTS:
: (75, 2)
: (2, 2)

